# Lab | Data Structuring and Combining Data

## Challenge 1: Combining & Cleaning Data

In this challenge, we will be working with the customer data from an insurance company, as we did in the two previous labs. The data can be found here:
- https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file1.csv

But this time, we got new data, which can be found in the following 2 CSV files located at the links below.

- https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file2.csv
- https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file3.csv

Note that you'll need to clean and format the new data.

Observation:
- One option is to first combine the three datasets and then apply the cleaning function to the new combined dataset
- Another option would be to read the clean file you saved in the previous lab, and just clean the two new files and concatenate the three clean datasets

In [155]:
# Your code goes here:
import pandas as pd 

url1 = 'https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file1.csv'
url2 = 'https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file2.csv'
url3 = 'https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file2.csv'

df1 = pd.read_csv(url1)
df2 = pd.read_csv(url2)
df3 = pd.read_csv(url3)

df1.columns = df1.columns.str.lower().str.strip().str.replace(' ','_')
df2.columns = df2.columns.str.lower().str.strip().str.replace(' ','_')
df3.columns = df3.columns.str.lower().str.strip().str.replace(' ','_')

display(df1.head(2))
display(df2.head(2))
display(df3.head(2))

,customer,st,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935

,customer,st,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,total_claim_amount,policy_type,vehicle_class
0,GS98873,Arizona,F,Bachelor,323912.47%,16061,88,1/0/00,633.6,Personal Auto,Four-Door Car
1,CW49887,California,F,Master,462680.11%,79487,114,1/0/00,547.2,Special Auto,SUV

,customer,st,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,total_claim_amount,policy_type,vehicle_class
0,GS98873,Arizona,F,Bachelor,323912.47%,16061,88,1/0/00,633.6,Personal Auto,Four-Door Car
1,CW49887,California,F,Master,462680.11%,79487,114,1/0/00,547.2,Special Auto,SUV

In [156]:
# 1. Reorder columns positions 'total_claim_amount' in df2 and df3:
df1.columns
ordered_columns = ['customer', 'st', 'gender', 'education', 'customer_lifetime_value','income', 'monthly_premium_auto', 'number_of_open_complaints','policy_type', 'vehicle_class', 'total_claim_amount']
df2 = df2[ordered_columns]
df3 = df3[ordered_columns]

In [157]:
# 2. Let's combine the three datasets:
df_all = pd.concat([df1,df2,df3], axis = 0, ignore_index=True)

# 3. Let's change st by state:
df_all.rename(columns= {'st': 'state'}, inplace=True)

In [158]:
# 4. Let's check gender unique values:
df_all['gender'] = df_all['gender'].str.lower()
print(df_all['gender'].unique())
df_all['gender'] = df_all['gender'].replace({'femal':'f','female':'f','male':'m'})
print(df_all['gender'].unique())

[nan 'f' 'm' 'femal' 'male' 'female']
[nan 'f' 'm']

In [159]:
# 5. Let's check state unique values:
print(df_all['state'].unique())
df_all['state'] = df_all['state'].replace({"AZ": "Arizona", "Cali": "California", "WA": "Washington"})
print(df_all['state'].unique())

['Washington' 'Arizona' 'Nevada' 'California' 'Oregon' 'Cali' 'AZ' 'WA'
 nan]
['Washington' 'Arizona' 'Nevada' 'California' 'Oregon' nan]

In [160]:
# 6. Let's check education unique values:
print(df_all['education'].unique())
df_all['education'] = df_all['education'].replace({'Bachelors':'Bachelor'})
print(df_all['education'].unique())

['Master' 'Bachelor' 'High School or Below' 'College' 'Bachelors' 'Doctor'
 nan]
['Master' 'Bachelor' 'High School or Below' 'College' 'Doctor' nan]

In [161]:
# 7. In Customer Lifetime Value, delete the `%` character*
df_all['customer_lifetime_value'] = df_all['customer_lifetime_value'].str.replace('%','')
df_all.head(2)

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,f,Bachelor,697953.59,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935

In [162]:
# 8. Replace in vehicle class, "Sports Car", "Luxury SUV" and "Luxury Car" by "Luxury":
df_all['vehicle_class'] = df_all['vehicle_class'].replace({'Sports Car':'Luxury','Luxury SUV':'Luxury','Luxury Car':'Luxury'})
df_all['vehicle_class'].unique()

array(['Four-Door Car', 'Two-Door Car', 'SUV', 'Luxury', nan],
      dtype=object)

In [163]:
# 9. Data types: convert 'customer_lifetime_value' into numerical:
df_all['customer_lifetime_value'] = pd.to_numeric(df_all['customer_lifetime_value'], errors='coerce')
df_all.dtypes

customer                      object
state                         object
gender                        object
education                     object
customer_lifetime_value      float64
income                       float64
monthly_premium_auto         float64
number_of_open_complaints     object
policy_type                   object
vehicle_class                 object
total_claim_amount           float64
dtype: object

In [164]:
# 10. Correct format for 'number_of_open_complaints':
print(df_all['number_of_open_complaints'].unique())
df_all['number_of_open_complaints'] = df_all['number_of_open_complaints'].str.split('/').str[1]
df_all['number_of_open_complaints'] = pd.to_numeric(df_all['number_of_open_complaints'], errors='coerce')
print(df_all['number_of_open_complaints'].unique())

['1/0/00' '1/2/00' '1/1/00' '1/3/00' '1/5/00' '1/4/00' nan]
[ 0.  2.  1.  3.  5.  4. nan]

In [165]:
# 11. Null values:
print(df_all.isna().sum()) #all columns have a significant amount of NaN, so .dropna() would remove a lot of info (50%)
print(df_all.shape)

customer                     2937
state                        2937
gender                       3064
education                    2937
customer_lifetime_value      2948
income                       2937
monthly_premium_auto         2937
number_of_open_complaints    2937
policy_type                  2937
vehicle_class                2937
total_claim_amount           2937
dtype: int64
(6000, 11)

In [166]:
# let's remove any row with NaN values in all columns, since there are many columns with the exact number of NaN.
df_all.dropna(how='all', inplace=True)
print(df_all.shape) # almost half of rows contained null values
print(df_all.isna().sum())  # gender and customer_lifetime_value have very little amount of NaN, let's remove those rows (not significant portion of data)
df_all.dropna(inplace=True)
print(df_all.isna().sum()) #no NaN values.

(3063, 11)
customer                       0
state                          0
gender                       127
education                      0
customer_lifetime_value       11
income                         0
monthly_premium_auto           0
number_of_open_complaints      0
policy_type                    0
vehicle_class                  0
total_claim_amount             0
dtype: int64
customer                     0
state                        0
gender                       0
education                    0
customer_lifetime_value      0
income                       0
monthly_premium_auto         0
number_of_open_complaints    0
policy_type                  0
vehicle_class                0
total_claim_amount           0
dtype: int64

In [167]:
# 12. Duplicates:
print(df_all.duplicated().sum()) # there are 991 rows duplicated, let's remove them:
df_all.drop_duplicates(inplace=True)
print(df_all.duplicated().sum())
df_all.shape

991
0

(1937, 11)

# Challenge 2: Structuring Data

In this challenge, we will continue to work with customer data from an insurance company, but we will use a dataset with more columns, called marketing_customer_analysis.csv, which can be found at the following link:

https://raw.githubusercontent.com/data-bootcamp-v4/data/main/marketing_customer_analysis_clean.csv

This dataset contains information such as customer demographics, policy details, vehicle information, and the customer's response to the last marketing campaign. Our goal is to explore and analyze this data by performing data cleaning, formatting, and structuring.

In [182]:
# Your code goes here
df4 = pd.read_csv('https://raw.githubusercontent.com/data-bootcamp-v4/data/main/marketing_customer_analysis_clean.csv')

In [183]:
# first columns is not relevant:
df4.drop('unnamed:_0', axis=1, inplace=True)

In [184]:
# let's remove spaces, lowercase...
df4.columns = df4.columns.str.lower().str.strip().str.replace(' ','_')

In [185]:
# let's check NaN values:
df4.isna().any() # No NaN

customer                         False
state                            False
customer_lifetime_value          False
response                         False
coverage                         False
education                        False
effective_to_date                False
employmentstatus                 False
gender                           False
income                           False
location_code                    False
marital_status                   False
monthly_premium_auto             False
months_since_last_claim          False
months_since_policy_inception    False
number_of_open_complaints        False
number_of_policies               False
policy_type                      False
policy                           False
renew_offer_type                 False
sales_channel                    False
total_claim_amount               False
vehicle_class                    False
vehicle_size                     False
vehicle_type                     False
month                            False
dtype: bool

In [187]:
# let's check for duplicates
print(df4.shape)
print(df4.duplicated().sum())
df4.drop_duplicates(inplace=True)
print(df4.shape)

(10910, 26)
443
(10467, 26)

1. You work at the marketing department and you want to know which sales channel brought the most sales in terms of total revenue. Using pivot, create a summary table showing the total revenue for each sales channel (branch, call center, web, and mail).
Round the total revenue to 2 decimal points.  Analyze the resulting table to draw insights.

In [197]:
# Assumption: total revenue is total claim amount
df_pivoted = df4.pivot_table(index='sales_channel', values=['total_claim_amount'], aggfunc='sum')
df_pivoted['total_claim_amount'] = df_pivoted['total_claim_amount'].round(2)
df_pivoted

# Results indicate that 'Agent' sale channel brought the most sales, followed by 'Branch', 'Call' center and 'Web'.

               total_claim_amount
sales_channel
Agent                  1748923.49
Branch                 1259333.44
Call Center             889094.77
Web                     676658.10

2. Create a pivot table that shows the average customer lifetime value per gender and education level. Analyze the resulting table to draw insights.

In [198]:
df_pivoted2 = df4.pivot_table(index='gender', columns='education', values=['customer_lifetime_value'], aggfunc='sum')
df_pivoted2

# Results indicate that education level 'high school or below' yields higher average custumer lifetime value for males and 'college' for females.
# On the other hand, the education level 'doctor' shows the lowest average custumer lifetime value for both males and females.

          customer_lifetime_value                              \
education                Bachelor       College        Doctor
gender
F                    1.286727e+07  1.190397e+07  1.414962e+06
M                    1.157767e+07  1.232351e+07  1.460727e+06


education High School or Below        Master
gender
F                 1.318350e+07  3.817032e+06
M                 1.221090e+07  3.278151e+06

## Bonus

You work at the customer service department and you want to know which months had the highest number of complaints by policy type category. Create a summary table showing the number of complaints by policy type and month.
Show it in a long format table.

*In data analysis, a long format table is a way of structuring data in which each observation or measurement is stored in a separate row of the table. The key characteristic of a long format table is that each column represents a single variable, and each row represents a single observation of that variable.*

*More information about long and wide format tables here: https://www.statology.org/long-vs-wide-data/*

In [169]:
# Your code goes here